Revit 2027 API
ParameterTypeId.RebarShapeParamEndHookTanLen Property
 "End Tangent Hook Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeParamEndHookTanLen { get; }
Public Shared ReadOnly Property RebarShapeParamEndHookTanLen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeParamEndHookTanLen {
	ForgeTypeId^ get ();
}
static member RebarShapeParamEndHookTanLen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace